[
    "0:00 introduction\r\n1:45 installing python and pycharm\r\n6:40 setup and hello world\r\n10:23 Drawing a shape\r\n15:06 Variables and Data types\r\n27:03 Working with strings\r\n38:18 Working with numbers\r\n48:26 Getting input from users\r\n52:37 building a basic calculator\r\n58:27 Mad libs Game \r\n1:03:10 Lists \r\n1:10:44 List Functions \r\n1:18:57 Tuples \r\n1:24:15 Functions \r\n1:34:11 Return statement \r\n1:40:06 If statement \r\n1:54:07 If statements and comparisons \r\n2:00:37 Building a better calculator \r\n2:07:17 Dictionaries\r\n2:14:13 While loop\r\n2:20:21 Building a Guessing game\r\n2:32:44 For loop\r\n2:41:20 Exponent Function \r\n2:47:13  2D lists and nested loop\r\n2:52:41 Building a Translator \r\n3:00:18 Comments \r\n3:04:17 Try/Except \r\n3:12:41 Reading Files \r\n3:21:26 Writing a file\r\n3:28:13 Modules and pip \r\n3:43:56 Classes and Objects \r\n3:57:37 Building a Multiple choice quiz\r\n4:08:28 Object Function \r\n4:12:37 Inheritance \r\n4:20:43 Python interpreter\r\n...Thank you...",
    "Want more from Mike? He's starting a coding RPG/Bootcamp - https://simulator.dev/",
    "Can We Just Appreciate How This Guy Took 4 Hours ( plus editing and practicing which is like more then 24 hours)   Out Of His Day To Teach Us Python For Free?",
    "I had to come here - 8 months after I watched your video. I studied economics, last year of masters. Nothing to do with coding whatsoever. Then I watched this video. Now I'm 8 months to python and Django. Just got my first paid software developer job. You have completely changed the course of my life and I'm thankful for that. First time in my life I like my job. I think you can live freely because you changed someone's life, it is almost like if you gave Dobby a sock. Keep it up and thank you.",
    "0:00 introduction\r\n1:45 installing python and pycharm\r\n6:40 setup and hello world\r\n10:23 Drawing a shape\r\n15:06 Variables and Data types\r\n27:03 Working with strings\r\n38:18 Working with numbers\r\n48:26 Getting input from users\r\n52:37 building a basic calculator\r\n58:27 Mad libs Game \r\n1:03:10 Lists \r\n1:10:44 List Functions \r\n1:18:57 Tuples \r\n1:24:15 Functions \r\n1:34:11 Return statement \r\n1:40:06 If statement \r\n1:54:07 If statements and comparisons \r\n2:00:37 Building a better calculator \r\n2:07:17 Dictionaries\r\n2:14:13 While loop\r\n2:20:21 Building a Guessing game\r\n2:32:44 For loop\r\n2:41:20 Exponent Function \r\n2:47:13  2D lists and nested loop\r\n2:52:41 Building a Translator \r\n3:00:18 Comments \r\n3:04:17 Try/Except \r\n3:12:41 Reading Files \r\n3:21:26 Writing a file\r\n3:28:13 Modules and pip \r\n3:43:56 Classes and Objects \r\n3:57:37 Building a Multiple choice quiz\r\n4:08:28 Object Function \r\n4:12:37 Inheritance \r\n4:20:43 Python interpreter\r\n...Thank you...",
    "Watched this video a couple years ago in high school, now I am a computer science student in my freshman year of college and in my programming fundamentals class my professor said our homework would be hard and take us 4-8 hours to complete. Obviously we are using python for this and I must say watching this video ahead of time has put me miles ahead of my classmates and I can easily finish my homework within an hour and watching a 4 hour video has taught me more than my college has taught me in a 4 month semester. Thank you!",
    "This dude really taught me HTML, CSS, C++, R and Python. What a legend.",
    "He wasn’t kidding when he said he’d would hold our hands and walk us through Python... \n\nClear explanations and great examples. Thank you!",
    "Props to you man, got me up and running.\nAnd to all the 4k people that disliked..he dedicated 4 hours of his time to share his knowledge\nand helped many MANY people with their dream\nand you dislike such a masterpiece? some people i will never understand.",
    "4 hours of information and effort put into EDUCATING with zero ads. \n\n\n\nYou're a passionate teacher, thank you for putting up this video.",
    "can you imagine it has taken me four days just to complete this 4 hr video, and I did an online python exam based on what you've taught and I scored a 73%. Can god bless you mike for teaching so well for free and may you live to teach more and more",
    "Few notes, some of them for Windows users:\nYou can use \"not\" without using \"not()\" function, like \"if not is_male\".\nIn open file lesson, I had to pass a path for file even if it's in same folder, import sys then pass path like [sys.path[0] + \"\\employees.txt\"]\nIn last lesson, use \"py\" not \"python\"",
    "So, I just finished this course in about 2 full days with notes with step by step pausing each time. It is very time consuming, but compared to paying for classes/courses (which I have already done) this has to be one of the best free courses as it teaches you many basics that you can implement into more complex problems. I am very grateful to be alive in era where we can experience quality teaching with no cost. Thank you so much!!",
    "Halfway through and all I can say is this is amazing man! Really good quality and easy to follow, been taking several notes, it serves as a good video to learn or as in my case to remember basic Python coding!",
    "When I got to the translator, I made a pig-Latin translator program that converts English to pig-Latin using everything I learned so far. Dictionaries, functions and for and while loops. Some stuff I had to look up when I was trying to do string and list manipulation, like .append(), but I knew the fundamentals because of you. Thanks Mike! I hope to go further with python because I had a great idea that has potential for $$$, so thanks for setting me down this path. Hope to take programming into a career in mechatronics as well.",
    "0:0 Introduction\r\n1:45 Installing python and pycharm\r\n6:40 setup and hello world\r\n10:23 Drawing a shape\r\n15:06 Variables and Data types\r\n27:03 Working with strings\r\n38:18 Working with numbers\r\n48:26 Getting input from users\r\n52:37 building a basic calculator\r\n58:27 Mad libs Game \r\n1:03:10 Lists \r\n1:10:44 List Functions \r\n1:18:57 Tuples \r\n1:24:15 Functions \r\n1:34:11 Return statement \r\n1:40:06 If statement \r\n1:54:07 If statements and comparisons \r\n2:00:37 Building a better calculator \r\n2:07:17 Dictionaries\r\n2:14:13 While loop\r\n2:20:21 Building a Guessing game\r\n2:32:44 For loop\r\n2:41:20 Exponent Function \r\n2:47:13  2D lists and nested loop\r\n2:52:41 Building a Translator \r\n3:00:18 Comments \r\n3:04:17 Try/Except \r\n3:12:41 Reading Files \r\n3:21:26 Writing a file\r\n3:28:13 Modules and pip \r\n3:43:56 Classes and Objects \r\n3:57:37 Building a Multiple choice quiz\r\n4:08:28 Object Function \r\n4:12:37 Inheritance \r\n4:20:43 Python interpreter",
    "I have tried at least 8 different courses to learn Python and out of all of them this one has been the best! Such a huge help, thank you so much for taking the time to teach us some Python!!!!",
    "Best course I've found so far. I'm 1.5 hours in, and it's clear, simple and straight to the point. If you're starting out - look no further and get to it.",
    "You are awesome.  You make things look easy. I like to thank you for making a dry subject to most people seem like ice cream in the heat of the summer . I'm 74 years old . I worked in NASA in the seventies in the last appollo trip then the oil industry . Using Fortran,  plm86 , and assembly language.  In 1984  left the field (a mistake) n went to sales. Now I'm raising my grand children\nand I need to work. I have degree in math n physics. I don't know what will be the area that I should approach aerospace  . Is python used in engineering applications.  Or should I learn different language. Any advice ?",
    "So far so good! I do my best to try to incorporate the previous lessons into the following ones (for repetition) even if its redundant. for example: in the Dictionary lesson I called a user input then used if/elif to compare the variable to the month code and printed based off that. Way more work, but good practice combining things.",
    "It's been a long time since i do python and my company need me to do some coding wityh python. Couldn't believe, my whole semester can be done in 4+ hours video.  Easy to understand. Very well explained.",
    "thank you for the course! really useful ^^",
    "Amazing course for beginners, thanks a lot.\nOne suggestion: if file name and class name are not the same, it would be a lot easier to understand where what has been referenced. For example, a python file name as \"Student\" for class \"student\" or file name \"Chef\" for class \"chef\", makes it slightly difficult to catch what has been referenced where in a new file. Thanks a lot once again, god bless you.",
    "Thank you so mush for this free course it really helped me!",
    "freeCodeCamp I love the work you guys are doing to this community\nremember my words. with these courses which you guys provide me for free i am learning a lot and i am hoping that i will be a developer one day. When i earn money you guys will be the first  place for me to donate.\nThanks for your service once again\ncheers !",
    "HI Sir, Mike \nI am start learning python from your uploaded file Sir Mike. You're my first teacher for Python subject. You're a good teacher and good teaching for me. You're uploaded file are totally support for me. Thank you so much Sir Mike. I totally like your teaching and explanation.\n0:00 introduction\r\n1:45 installing python and pycharm\r\n6:40 setup and hello world\r\n10:23 Drawing a shape\r\n15:06 Variables and Data types\r\n27:03 Working with strings\r\n38:18 Working with numbers\r\n48:26 Getting input from users\r\n52:37 building a basic calculator\r\n58:27 Mad libs Game \r\n1:03:10 Lists \r\n1:10:44 List Functions \r\n1:18:57 Tuples \r\n1:24:15 Functions \r\n1:34:11 Return statement \r\n1:40:06 If statement \r\n1:54:07 If statements and comparisons \r\n2:00:37 Building a better calculator \r\n2:07:17 Dictionaries\r\n2:14:13 While loop\r\n2:20:21 Building a Guessing game",
    "I finished your sql course, now im doing Python. Im loving your TUTs. amazing valuable content\n\nUpdate: Now after ton of practise, I can write pretty complex SQL queries and can also write basic python",
    "Thank you soo much for this free course I learned a lot about python. 1hour per day and i'm just getting started learning and i know i will become a great programmer someday <3\nGod bless us!",
    "I have just finished this tutorial. It helped me to review basics of Python. Thank you very much!",
    "Thank you sir. This is a really good course that has helped me get started and you are an excellent instructor. Subscribed.",
    "I am back because of the tutorial you put up for the AWS Cloud Solution Architect certification. It was the tutorial that cleared up a LOT of confusion for me. So I am really looking forward to this course. Thank you so much and keep up the great work!",
    "(for me) + 15:37\nTimestamp: 36:45 (Working with Strings)",
    "Hi! I just finished this course, and I have to say, this was the clearest explanation of python I've ever come across! I've been having so much fun playing around with python, and I just wanted to thank freeCodeCamp and Mike at Giraffe Academy for this video.",
    "Am grateful for this tutorial even though I haven't done anything yet besides downloading python and pycharm. I'm a second year electrical engineering student but want to become a programmer, you've got a new subscriber. Looking forward to learning more and more new tutorials. Thanks",
    "I’m enjoying learning python thank you so much!! 2 hours in and I’m getting it!! Excited to learn more about python and other languages!",
    "Would be more helpful if the “object functions” was before “building a multiple choice quiz” as it would increase the clarity of how to use classes",
    "Several weeks ago I commented that I was a few days away from turning 73 and I was learning Python.  I was overwhelmed at the likes and replies given my post.  Thank you all so much.  Some even replied with a 'birthday wishes' Python program.  I have tried many times to like all the replies, but as I continue to click 'Review replies', YouTube eventually reloads.  I apologize that I cannot like every reply.  A few asked why I was learning Python at my age.  I'm still working full time, and I believe new skills are always good.  Others asked how my learning was goin.  I watch some of the video, then practice to determine how much I have learned then watch more and practice. My goal is Python certification.  Again, thank you all for your support.",
    "Some Keypoints I noted down:\nPython:\n\nAlways typecast your input\nDefault input is always string\n\n*List:\n List can store multiple data types at a time(can be changed)\n List Function:\n f1.extend( f2 ) - adds two lists\n f1.insert( index, f1)- inserts an elements\n f1.remove(value) - removes the element\n f1.pop() - removes last element off the list\n f1.count(value)- counter \n f1.reverse() - reverses the original order of the list\n f2=f1.copy() - will copy one list to another\n\n\n*Tuple - can’t be changed once declared(same as list)\n Use normal brackets not square brackets\n ex_tuple = ( 4,5 ) \n\n\n*Function:\n Keyword - def\n Example -def ex_func():\n Every function needs to be called in order to be executed.\n\n\n*IF\n or- || , and-&& , not()- negate \n Syntax-\n if condition1 :\n elif condition2:\n else :\n\n\n*Dictionaries:\n Can excess certain values by shortcuts or abbreviations\n  ex_dic={\n    “Jan” : “January” ,\n     “Feb” : “February”\n   }\n  print(ex_dic(get( “Jan” , “ Invalid “ )))   // used get() to avoid invalid  inputs\n\n\n*While:\n Syntax:\n while condition:\n {}\n\n\n*For:\n Syntax:\n for variable in range( the range for loop):\n {}\n\n\n*2D List:\n ex_2D = [ [1,2,3] ,\\ [4,5,6] , [7,8,9] , [0] ]\n for row in ex_2D:\n     for col in row:\n         print(col)\n OUTPUT: \n All elements one by one\n\n\n*Comments:\n #anythinginsidethishashtagwillbeacomment \n\n\n*Try/except :if user enters a wrong input\n  Syntax:\n  try:\n    #ifanyerroroccurshereexceptwillrun\n  except typeoferror:\n     #statements\n\n*Read files\n  If you open a file ,always close it.\n  file=open( “file.txt” , “ r ” ) #thiswillreadthefile\n  print( file.readable()) #readable()willgiveoutabooleanvalue\n  file.close()\n  *readlines() - will convert each line to an index of an array* \n \n*Write files\n  file=open( “file.txt” , “ a ” ) #thiswillappend\n  file=open( “file.txt” , “ w ” ) #thiswilloverwrite",
    "This is honestly the beauty of the internet. I'm sure people pay good money to take courses that give you the same amount of information as this video. But in this case, there's a great, clear teacher, and you can pause and rewind as much as you need and its free! I'm 48 minutes in and really enjoying it.",
    "Watched this course 6 months ago. Now I'm a junior software developer at Volvo Cars. This just proves you don't need to waste money and time for school. Thank you for making this.",
    "Hi I watched this video about 5 months ago and now 5 months later, I am able to make complex programs as well as Visual games and applications using Tkinter and pygame. It take practice so don't give up!\nAlso once you finish this video I recommend take a Udemy python source to revise everything as well as learn new stuff, you will be a master in no time.\nGOOD LUCK!",
    "Hello guys, i am in vacation from school, waiting to start the college, so i decided to learn programming and thats how im starting. I want to end the video in 4 days max and then start to practice! Hope u guys start doing this too.\n\r\nDay 1 of learning Python: 1:03:41 (Lists) - I wanted to start with 1h and half but thats no problem, i think it was a good beginning, im writing the new thing in an note and practicing with the pycharm. Good first day and i hope this comment help me to be more focused, cya tomorrow.\n\nDay 2 of learning Python: 2:00:37(Building a better calculator) - Second hour done, ok i finished it at 23:58 but nevermind, i did it, and i will do even better tomorrow if i get the mark i need in an exame, so, my free time depends on it. Anyway, i have the sensation that im learning the content and i still focused on finishing the video in more 2 days(this comment helped a lot btw). Hope u guys who commented are having progress too, cya tomorrow.\n\nDay 3 of learning Python:  2:00:37(Building a better calculator) - Yeah, i did nothing today xD, relaxing day.\n\nDay 4 of learning Python: 3:12:43(Reading files) - Another hour! i was not inspired to study today, but i reached the third hour and will finish this tomorrow. Im liking the course, its just a little hard to me to be focused for long periods of time, but im getting better. Python is very clean to work, compared to c#, really.\n\nDay 5 of learning Python: I did it! I learned the basics of python in 5 days, im really proud of myself for doing some productive stuff in vaction. Actually, i really liked this professor, his objective way of teaching turned it way more easy. I want to practice now and continue my coding journey. I hope this comment have been helping someone, it made me more focused because i did not want to leave the impression that i forgave and went down due to procrastination. Anyway, thanks Mike! (Sorry for any english mistake, thats not my native language).",
    "Hey @swallowedinthesea11, thank you for helping people in the comments box. I have a query too, this is my first video into coding. Python is the first language that I'm learning. I would like to know which course/video should I watch to progress after completing this. Thank you!",
    "I took my first intro Python class at Stanford, and it didn't go well, so I ended up dropping it! Now I feel so much ready for Computer Science in general, and on a software track. Thanks to you bro.",
    "Thank you for your splendid demonstrate",
    "4:20:43 For Windows interpreter, you just have to type in \"python\" not \"python3\"",
    "Hi, it's my code for translator, I didn't use a second string to return, instead I changed the original parameter:\n\ndef translate(string):\n\tfor i in string:\n\t\tif i in [\"a\",\"e\",\"i\",\"o\",\"u\"]:\n\t\t\tstring=string.replace(i,\"g\")\n\treturn string\n\t\nprint(translate(input(\"Word: \")))",
    "Walter White Jr. teaching Python?! Thanks for the amazing video; I feel much more confident about getting into coding on the side.",
    "Loved your training video with one exception. You made it sound simple to download PyCharm as a text editor, and when I did so IT WOULD NOT RUN because it asked me what version of Python I was using, and no matter what I entered it said, \"Not valid . . . please enter a valid version if Python. I worked on for almost 3 hours, trying everything, but it never opened not even once. I wrote them and email, but no response. So if you want to advise using PyCharm, please tell us how to work around this obstacle. I\"m using Python 3.10.7. Thanks Jeff Boyd",
    "Thanks I learned a lot of how Python works as an non-ITer! The one thing I missed was how to make the code run userfriendly on your PC/app. For example with an Icon on your desktop.",
    "Gracias Genio!, siempre tuve curiosidad sobre programación, pero nunca me senté a leer nada porque no sabia por donde empezar.. hasta que di con este video y ahora mi hobbie es aprender programación jaja",
    "Thank you so much for helping me in my software developer journey",
    "Your video is rlly helpful and easy to understand!! thanks a lot!",
    "That python video helped my absolute beginner python skill to change a bunch. Thanks sir. You are one of my best online teachers",
    "Thank you I always thought python would be hard to use thanks to u it's not",
    "If you want to learn, build the programs and then watch his examples to compare...unless you just don't know the code, but farther in its possible, and will help you learn a lot more. Great videos, thanks!",
    "Thanks for holding my hands all the time Mike. You are the man!",
    "Watching your video from india . and i am really happy to after watching your tutorials . because i explore so many videos in youtube but no one can explain like you. You really explaining very clearly and perfectly . thank you so much",
    "Thank you so much. great help to me !!",
    "Yo thank you so much for this, in 2 days I completed the course and i’m going forward to more complicated stuff, thank you for doing this such a clear and understandable video :))",
    "i like how you have shown us practical uses of python. great",
    "This guy just sat 4 and a half hours recording on the same day to upload a free video. Man,  just thanks!",
    "I completed this 4:26:52 hours course and this is longest video I ever watched in my life and thanks for this video it gonna help me a lot in my further python journey!",
    "I am a total beginner and for me this is one of the best tutorials of any kind I have seen! I was left confused by other videos but this makes total sense - and is quite fun to follow. Thank you!",
    "This was the first video that taught me to code in python just last month. After a month of code and  watching other videos, i made an AI assistant for my computer fully voice controlled and controllable through messenger. Just came back here to watch again and compare how totally uneducated i was back then. Im really far and would like to thank this man for it. Insert *Carefully, hes a hero* meme here.\n\nMore power to the giraffe!",
    "Just starting my coding journey after many years of procrastination and other people coding for me.  So far this is all very clear. Trying to use this to interpret what others have written for me.   It’s a start. Thank you",
    "I'm an intermediate at programming and watched MANY videos.  This one is BY FAR the best explained and easy to follow for a TRUE beginner.",
    "I didn't imagine I'll be learning python at home at a time like this, i hope i can enjoy this lesson and use python for my personal projects",
    "I just finished this course and I feel like I've learned more and had my eyes opened to the possibilities more with this than any of the previous beginner online courses I've been through.  Well presented with just enough information in each topic to get the mind playing with ideas, see possibilities and have enough instruction to get started.  Just amazing content and worth every minute spent.  Kudos to you Mike.",
    "Thanks for the time you took to put this together. I'm an old coder who retired in his 40s, but who still watches stuff like this for hobby and interest. I can imagine that your easy approach to teaching this subject has/will gain a lot of traction. Well done. For example you avoid to burden your audience with abstract Computer Science theories in an effort to simply explain working with basic strings. TWO QUESTIONS: 1) Did you do this video as part of an instruction series?  2) Did you do this video on your own accord? Just curious. Thanks again, and well done.",
    "0:00 Introduction\n\n1:45 Installing python and pycharm\n\n6:40 Setup and hello world\n\n10:23 Drawing a shape\n\n15:06 Variables and Data types\n\n27:03 Working with strings\n\n38:18 Working with numbers\n\n48:26 Getting input from users\n\n52:37 building a basic calculator\n\n58:27 Mad libs Game \n\n1:03:10 Lists \n\n1:10:44 List Functions \n\n1:18:57 Tuples \n\n1:24:15 Functions \n\n1:34:11 Return statement \n\n1:40:06 If statement \n\n1:54:07 If statements and comparisons \n\n2:00:37 Building a better calculator \n\n2:07:17 Dictionaries\n\n2:14:13 While loop\n\n2:20:21 Building a Guessing game\n\n2:32:44 For loop\n\n2:41:20 Exponent Function \n\n2:47:13  2D lists and nested loop\n\n2:52:41 Building a Translator \n\n3:00:18 Comments \n\n3:04:17 Try/Except \n\n3:12:41 Reading Files \n\n3:21:26 Writing a file\n\n3:28:13 Modules and pip \n\n3:43:56 Classes and Objects \n\n3:57:37 Building a Multiple choice quiz\n\n4:08:28 Object Function \n\n4:12:37 Inheritance \n\n4:20:43 Python interpreter",
    "1:33:00 - worth pointing out that you can explicitly assign parameters, e.g. def f(a,b): when called can be f(b=2,a=4)",
    "I am a father of 9 soon to be 10. I am a cnc set up machinist. I have been looking at learning programming for a while now, I seem to always find some lame excuse not to though. I'd like to learn with goal of being to work some, if not all of my time from home. I also believe programming will allow the opportunity to earn more and give my family the breathing space financially to do things we can all enjoy. So, any advice and suggestions thrown my way will always be gratefully received. Thank you for reading my ramble. Also, good luck to all those reading this who are at the same stage of the journey as I am.",
    "I started learning coding from your video and I have something that is confusing me. in 1:33:10 \nWhy do we have to put the numbers 35 and 70 into strings in order to make the function work? subbed to your channel btw. thanks",
    "Still early days but thank you so much for the tutorial! Really helpful! Was wondering if anyone could tell me what is wrong with this code? No matter what I type in it always prints 'Not an operator' even if I enter one in. If anyone is able to help thank you!\n\nop = input(\"Enter an operator: \")\nif op != \"+\" or \"-\" or \"*\" or \"/\":\n    print(\"Not an operator\")\nelse:\n    print(\"Thank you\")",
    "Me gusta mucho el vide no se nada sobre esto estoy intentando aprender por mi cuenta 😅 aunque no entiendo muy bien ya que la traducción automática de español no traduce muy bien que digamos",
    "2:30:42\n\ni kind of played around with the code as I went along and did the final 2 lines in the guessing game as\n\nif guess == secret_word:\n   print(\"You win!\")\nelse:\n   print(\"You lose!\")\n\nhow does this differ from the lines of code he did?\n\ni achieved the same result but i imagine mine would work differently in a specific scenario",
    "Working on my special project. Using this to brush up on my knowledge because I haven't Touched Python in a year.\n\nIt's a unit converter that will convert everything into miles, regardless of what you try to convert and then explain why Freedom Units are better. I like making useless programs.",
    "Probably the best and most concise tutorial on Python out here.",
    "Thank you for the video. I'm starting to learn Python after knowing how to work with RStudio.",
    "Took me few weeks to complete this   ... Thanks for the tutorial",
    "Thank you Proffesor, if i get an 8 or 9 in gcse computer science it will be because of you",
    "I am very new to python but I can say I fully understand the basics of what I learnt here. Thanks a lot for this.",
    "Steps to learn all\n.Make notes topic by topic\n.practice after making notes\n.Make a plan to learn,give 40 mints daily and practice in real time\n.When moving to next day,revise what u learned last day in 5 mints.\n.if u dont have pycharm, dont worry open online compiler but must do practice\nThanks alot",
    "Thank you for making it understandable",
    "@freecodecamp i found a problem in this,  Mike says we cannot print once a return statement is done. But actually he indented the print(code)inside of the function henceforth its not able to do so. Please rectify for the community of learners who rely on you. And also if am wrong over any point please feel free correcting me! \n\nThanks from a newbie learning from your great and free resources!!",
    "Some advice beginners\n what ever you learn you just pause video and think and try when where and how can you can use it \nSecond: watch multiple videos related to coding because everyone has there own methods and technic \nThird advice: learn little bit every day and take a break while coding so it would not effect your mental as well as physical health and sometime after break you will find your solution to your problem in coding that you were facing earlier😉👍👌💛",
    "Can you explain the logic behind 2:28:34 ?  Why  we set out_of_guesses boolean as False at first? Why are we using not(out_of_guesses) ? And can we use out_of_guesses == False instead?",
    "Thank you very much for this video! :)",
    "For EXPONENT FUNCTION:\nI understand now after so much time I put in this video just to understand the for loop with exponent function.\r\nIt basically just like this.\r\nUsing for loops in range() means that you know how often you want to do something.\r\nrange(2) means for loops will executes twice(2).\r\nrange(3) means for loops will executes 3 times.\r\nresult = 1 * 3\r\nreturn result with 3,\r\nstart again from for loops statements,\r\nresult = 3 * 3\r\nreturn result with 9 (output).\r\nWe will stop at here because the range() that we call is 2 which is also (power_num) \r\nthe (base_num) which is 3 will stay the same.\r\n \r\nyou can also type this in your IDE:\r\nprint(1 * 3 ** 2)\r\nand you will see the same result.\r\nfor you guys that's struggling to follow. 🥲(me too, at first)\r\n\r\n*another ways to see the output of exponential function (not straight way using **)\r\nedit: teacher Mike use for loops and not while loops because while loops is use for when the arguments is TRUE.",
    "hi i am a begginer with no experience in my backround in this field,  i like your courses, the simple indication and i really want to learn about coding. My big question here is how to have a job in this field?  I want to learn from your courses ( i want to tell that i learn alone from zero and i have my mind open for new and improving myself after i learn the basic and get a job hopefully.",
    "Can i get a certification after finish this course? Or can you point me to one that will do?\n\nThanks for the class. And the teaching. Well appreciated.",
    "for anyone running Python 3.7 and above,\nuse \"py -m ensurepip --upgrade\" (without the quotations) to check that status if your pip\nto install the latest, use \" py -m pip install --upgrade pip\"",
    "I just finished the course!!!!!!  just started on my coding python journey! I’m excited! Thank you!",
    "I'm 13 years old and I'm trying to learn how to code and this tutorial has really helped me. Thank you for this tutorial!",
    "Respect to you for providing this and doing so without any gain from ad revenue.",
    "0:00 introduction\r\n1:45 hello world\n6:40 functions\n10:23 creating a file\n15:06 taking control over your neighbours garage door\n27:03 control your own pc\n38:18 hacking a computer\n48:26 gaining access to NASA\n52:37 make a spreading virus\n58:27 get your first victims\r\n1:03:10 using NASA press to spread virus\n1:10:44 Virus spreads to pentagon\n1:18:57 Hacking into missiles\n1:24:15 Sending missiles to NK\n1:34:11 Manipulate powergrids\n1:40:06 create a new gender\n1:54:07 - 4:20:43 how to define variables\n\n...Thank you...",
    "Such a fresh and great content. I'm not a programmer but I started to do data analysis in my job and your videos help just amazingly, I can understand the different components perfectly. Watched other videos from other sources but they were a little hard to understand. Thank you very much for this, your channel is amazing",
    "you literally took less than half the time to explain the same content as my lecturer, but more efficiently and effectively. thank you so much 😭",
    "also worth mentioning, if you want to take notes in your Python file while you are learning, you can use the \"#\" symbol to take a note right in the file.\n\nExample:\n\n# This is how you take a note!\n\ncharacter_name = 'John'\ncharacter_age = 35",
    "cool text based gun handling sim I made (longest code yet)\ntype:\nshoot : to shoot (can only do so if the safty is off and the chamber is loaded)\n0/1/2: 0 for safe/ 1 for semi / 2 for full auto(just empties the gun) \ncycle bolt : used in reloads to charge the handle\nremove mag : removes magazine\nreload mag : fills up the magazine (can only do so if the mag is removed)\ninsert mag : inserts magazine into the gun\ncheck mag : to see how many rounds you have\ncheck chamber : to see if you are ready to shoot \nto reload the sequence would be\nremove mag  reload mag  insert mag  cycle bolt\ncode:\nans = 0\r\nin_chamber = False\r\nmag_in = True\r\nrounds_in_mag = 30\r\nwhile ans != \"exit\" :\r\n    ans = input (\"enter command(: \")\r\n    if ans.upper() == (\"CHECK MAG\"):\r\n        print (rounds_in_mag)\r\n    if ans.upper() == (\"CHECK CHAMBER\") :\r\n        if in_chamber :\r\n            print (\"live one in the chamber\")\r\n        elif not(in_chamber):\r\n            print (\"no live round in chamber\")\r\n    if ans.upper() == (\"0\"):\r\n        fire_mode = 0\r\n    if ans.upper() == (\"1\"):\r\n        fire_mode = 1\r\n    if ans.upper() == (\"2\"):\r\n        fire_mode = 2\r\n\r\n    if ans.upper() == (\"SHOOT\") :\r\n        if in_chamber and mag_in == True and fire_mode == 1:\r\n            if rounds_in_mag > 0 :\r\n                print(\"bang(round ejected and new one chambered)\")\r\n                rounds_in_mag = rounds_in_mag - 1\r\n            elif in_chamber and rounds_in_mag == 0 :\r\n                print(\"bang(round ejected but now your dry)\")\r\n                in_chamber = False\r\n        elif in_chamber and mag_in == False and fire_mode == 1 :\r\n            print (\"BANG(round ejected but you chambered nothing since mag is out)\")\r\n            in_chamber = False\r\n        elif not(in_chamber) :\r\n            print(\"click(must chamber a round first)\")\r\n        if fire_mode == 0 :\r\n            print (\"cant shoot if safty is on\")\r\n        if in_chamber and mag_in and fire_mode == 2 :\r\n            if rounds_in_mag > 0:\r\n                while rounds_in_mag != 0 :\r\n                    print (\"bang\")\r\n                    rounds_in_mag = rounds_in_mag -1\r\n                print(\"mag emptied\")\r\n                in_chamber = False\r\n            if rounds_in_mag == 0 :\r\n                print (\"bang(round ejected but now your dry)\")\r\n                in_chamber = False\r\n        elif in_chamber and mag_in == False and fire_mode == 2 :\r\n            print (\"BANG(round ejected but you chambered nothing since mag is out)\")\r\n            in_chamber = False\r\n        elif not(in_chamber) and fire_mode == 2 :\r\n            print(\"click(must chamber a round first)\")\r\n\r\n\r\n\r\n    if ans.upper() == (\"CYCLE BOLT\") :\r\n        if in_chamber and mag_in :\r\n            if rounds_in_mag > 0 :\r\n                print(\"ejected round and chambered new one\")\r\n                rounds_in_mag = rounds_in_mag - 1\r\n                in_chamber = True\r\n            if rounds_in_mag == 0 :\r\n                print (\"gun emptied\")\r\n                in_chamber = False\r\n        if not(in_chamber) and mag_in:\r\n            if rounds_in_mag > 0 :\r\n                print(\"round cycled in(ready to shoot)\")\r\n                rounds_in_mag = rounds_in_mag -1\r\n                in_chamber = True\r\n            if rounds_in_mag == 0 :\r\n                print (\"nothing chambered since mag is empty\")\r\n                in_chamber = False\r\n        if in_chamber and not(mag_in):\r\n            print(\"round ejected gun empty\")\r\n            in_chamber = False\r\n        if not(in_chamber) and not(mag_in):\r\n            print (\"nothing happened since no mag in and chamber empty\")\r\n    if ans.upper() == (\"RELOAD MAG\") and not(mag_in) :\r\n\r\n        rounds_in_mag = 30\r\n    elif ans.upper == (\"RELOAD MAG\") and mag_in :\r\n        print (\"must remove mag from gun to fill it up\")\r\n    if ans.upper() == (\"REMOVE MAG\") :\r\n        if not(mag_in):\r\n            print(\"mag already out\")\r\n        mag_in = False\r\n    if ans.upper() == (\"INSERT MAG\") :\r\n        if mag_in :\r\n            print (\"mag already in\")\r\n        mag_in = True",
    "Hi, thank you from India. Contributed what I could just as a token. Hope you get all the success and light in life. Thanks ",
    "*Homeworks:\n- Madlibs Game: To do\n\n*Notes:\n- Day 1: from 0:00 to 1:54:00",
    "How does this course compare to the 12 hour Python course here? https://www.youtube.com/watch?v=XKHEtdqhLK8\nBig thanks to creators of both video, just curious which one I should watch.",
    "For the beginner: He went to the 2nd tutorial on Drawing a Shape but I'm still looking at Hello World on my screen in PyCharm....how did he get to the fresh page? Did he create a new project? is this shape gonna be in \"app\"? how do we get rid of our work from Hello World and have a fresh blank? Do we just erase it?",
    "2:20:21 - my solution for the guessing game... it's a couple of lines shorter than his I believe. Granted, I'm new at this, so there may be reason/s that his method is superior to mine, but I came up with this:\n\nsecret_word = \"matchbox\"\r\nguess = \"\"\r\nguess_count = 0\r\nguess_limit = 5\r\n\r\nwhile guess != secret_word:\r\n    if guess_count < guess_limit:\r\n        guess = input(\"Enter your guess: \")\r\n        guess_count += 1\r\n    else:\r\n        print(\"Out of guesses, YOU LOSE!\")\r\n        break\r\n\r\nif guess == secret_word:\r\n    print(\"Congratulations! You win!!\")\n\nwith my method, you don't need a \"out_of_guesses\" variable and the if statement that follows the while loop only needs to check for a single condition.",
    "Hello Mike!Nice video..just want to ask..can python do this?Id like to create a program in which it can execute video files and use player like VLC , then create a search menu for it?",
    "I am a total beginner here. My question is, after copying examples of your code, where can we publish it (maybe copy-&-paste) so another user can test it out on their computer? For example, if I want to create my own Multiple Choice Test as shown in 3:57:37, after creating my questions, how can I show it to a friend to take the test on their computer? Any help will be greatly appreciated.",
    "easy to follow 👍",
    "awesome that you put this up for free dude",
    "Hi, i am new to coding, and I start learning Python at from last week.\r\ni am working in a automobile manufacturing company as a labour.\r\nwe have 2 shifts and we change shift every week.\r\n\r\nin day shift we start from 6:30 to 15:35, with 3 breaks. 8:30 to 8:40, 10:40 to 11:25 and 13:25 to13:35. and another short break at 15:35 to 15:40 if we work overtime.\r\n\r\nin 1 shift we can do 2 kind or work, and the time is count separately.\r\nfor example in line 1, I worked from 6:30 to 11:55 and work on line 3 from 12:00 to 15:10\r\n\r\nat the end we spent times to calculate total working minutes minus those breaktimes (work on line 1, line 3 and the total of working minutes)\r\n\r\nQuestions:\r\nI keep wondering if coding with Python can help me count faster? If yes, how_\r\nthank you in advance,\r\n\r\nSincerely yours,\r\nCharlie",
    "Im a beginner and this helped me a lot",
    "Thank you, Sir!",
    "Thanks for helping me recall python",
    "Hi, can I ask why we need to install both pycharm and python? Thank you",
    "Did you try to run the program after you changed the variable type to an int? @25:28  I have an error, \n\nTypeError: can only concatenate str (not \"int\") to string.",
    "thank you now I have proper profile for python <3",
    "Can i use VS code.  And also I love this channel so if your new to the channel don't sweat it it is totally worth it😀",
    "17 and learning to code to make some indie one off games! Got ADHD, so having a hard time focusing, but REALLY determined to do this! Thanks for all the help so far!",
    "0:00 introduction\r\n1:45 installing python and pycharm\r\n6:40 setup and hello world\r\n10:23 Drawing a shape\r\n15:06 Variables and Data types\r\n27:03 Working with strings\r\n38:18 Working with numbers\r\n48:26 Getting input from users\r\n52:37 building a basic calculator\r\n58:27 Mad libs Game \r\n1:03:10 Lists \r\n1:10:44 List Functions \r\n1:18:57 Tuples \r\n1:24:15 Functions \r\n1:34:11 Return statement \r\n1:40:06 If statement \r\n1:54:07 If statements and comparisons \r\n2:00:37 Building a better calculator \r\n2:07:17 Dictionaries\r\n2:14:13 While loop\r\n2:20:21 Building a Guessing game\r\n2:32:44 For loop\r\n2:41:20 Exponent Function \r\n2:47:13  2D lists and nested loop\r\n2:52:41 Building a Translator \r\n3:00:18 Comments \r\n3:04:17 Try/Except \r\n3:12:41 Reading Files \r\n3:21:26 Writing a file\r\n3:28:13 Modules and pip \r\n3:43:56 Classes and Objects \r\n3:57:37 Building a Multiple choice quiz\r\n4:08:28 Object Function \r\n4:12:37 Inheritance \r\n4:20:43 Python interpreter\r\n...Thank you...",
    "i wish all my teachers taught as well as you did, literally had no doubts. Thank you!",
    "For those just starting this, I'll note that for Windows users (and maybe this was an issue before but I'm just putting python on a new comp) by default \"Add Python to Path\" is no checked by default on installation. You are almost certainly going to want to check this box before installing. Later in the video (in the Modules and PIP) section, you'll encounter some confusion when trying to follow along here.",
    "Lifehack: Once you learn how to make a Multiple Choice Quiz, make one to test yourself on everything you've learned in this video! I plan to do that soon and figured it would be a cool thing to share and may help some people! Thank you for the amazing course, Mike.",
    "I had always avoided python because I thought it was too difficult. Other videos left me feeling confused and frustrated. Mike changed my entire perception of python and coding in general. Thank you, Mike. I cannot thank you enough!",
    "For anyone on Windows 10 struggling with getting Pycharm to run your code, theres some slight differences to what you have to do in the initial setup (at least for me it was!)\n\nWhen you set-up your project, to pick your interpreter you'll need to locate the .exe of Python 3, it won't be available on the drop down straight away.",
    "Thank you so much for this! I appreciate that you have separate and organized clips for every topic and how you practically explained and walked through the basics of Python’s features. Great resource!",
    "can I just say, you are a genius. I'm 14 and u have helped me figure out coding, I am doing a project at school and I've been really stuck on it, this video is exactly what i was looking for and the question was about riddles \nonce again thank you so much. I'm going to share this video with people in my class cuz this helped me understand",
    "Now I am trying to learn Python theoretically without practical application Because I couldn't get enough money to get a laptop😔\n I'm so frustrated Please pray for me that I can buy one",
    "I’m learning Python at age 86. I worked as a computer programmer from 1970 until 1982, but that was using the older languages. FORTRAN, versions of BASIC and bits of Pascal, PL/1, and even the old, old 8080 assembly. Those may be old but having that background makes it a lot easier to pick up the more modern languages. (Not that questions don’t still come up during the studying.) I didn’t have to program for years because most software I needed could be purchased (database, search apps, and other utilities). But recently I need a program to do a task such that I will have to code it myself. So Python seems like a good candidate. This course is remarkable in its clear presentation and scope. My recently acquired Python version, however, is now 3.10 and the screens have become laden with many uncovered menus and options. I congratulate Mike on his very clear speaking ability, his knowledge of idioms (for one apparently so young), his exceptional talent for teaching, and thorough knowledge of the material. [After that praise I hope he won’t be offended if I offer one minor correction: etc is pronounced ET cetera, not ECK cetera.] But please keep up the fantastic work!",
    "Me and my friends at the age of 96  learning this course ,so we can die peacefully. Hope it would be beneficial in other life . Hoping for the best",
    "38:20 first chapter for me done",
    "Hi! Sir I am start beginner for python and I watching YouTube from your teaching. (Character_year ) not work in python and that is erroe code ... why not... please explain to me when you have any time, please sir ... I am start learning .. only python!. I am not understand Java, CSS, etc... I am only beginner and learning start Python.",
    "I am a beginner.\nPlease tell me what to do after understanding this complete tutorial ??\nWhat should be the following path to lead me to do actual work and get paid.\nThank you for your guidance.",
    "Can someone tell me how he gets those brackets to appear after the word Print?\n\nIs it a keybind via settings or pressing buttons on the keyboard?\n\nThank you.",
    "Will this course alone be enough for me to become “experienced” in python? As in, if I put this on my resume, what level of skill would I put?",
    "\"i do not have friends, i have values.\" - Mike",
    "ngl man thanks for this video, learnt alot of python and im very grateful man",
    "I'm learning Python for my first step road map for Data science, I love gaming I'm not sure if Open world games programming use python like Engine 5 for example",
    "i enjoyed that i'll come back tomorrow!! (and thanks <3)\n1:03:08\n2:00:37\n2:40:38 im so sleepy\nIM DONE!!\ni get it but if u want me to write what i just learned w/o looking at my notes, i wont be able to do it lmaoo but it's not like i need to memorize it. school's the only one that requires that stuff\nit's a good introduction of python and it really isnt as easy i thought it would be\nbut thanks! and i like the speaker, he's so easy to listen to",
    "Thank you!!!",
    "@25:18 he says you can just use numbers here without quotes, but I got a \"TypeError: can only concatenate str (not \"int\") to str\" error",
    "Thank you bro 🙏",
    "In the return statement if you type\nprint(num*num*num) \nAnd then if you put  cube(3) \nIt will get the result 37 \nAm i right brother 😃",
    "Question if you permit\nWhen we write not(out_of_guesses), that means out_of_guesses=True, and we assigned it as False, need clarification please",
    "Hes the best can we please have a continuation from here",
    "Thank you 🙏",
    "note that you can play this in 2x speed and it would be just as understandable",
    "Thanks for this freecodecamp",
    "i am going to give this course a try. i am very new to programming in terms of experience, granted i have been playing around in unity, unreal 4, and others for a long LONG time now but i have never been able to get going because i lack the focus and the ability to sit with it all the way through. problem one being i have no one to learn with and thus i feel as if my goal to learn is pointless? whats the point in me learning if i have no friends that i can learn with or talk to during the process? i have no one that shares the interest in my life so why must i dedicate all of my time learning what is essentially a waste of my time? i am well aware that i am wrong, i am well aware that this train of thought is common and is a reason why many people struggle and or fail to ever catch on and i have heard all of the same encouraging themes before such as \"dont let their absence stop you from learning something new\" or \"you can do it and excel if you just put in the time\"... my other problems are that my brain likes to know WHY alot. WHY is it we are typing code a certain way? WHY do we have to put the code in this area when it would work just as well 10 or so lines up? and you see this causes me issues because when im not being told WHY we are doing something in a certain way or why something is the way that it is my motivation shuts down because im not getting that reinforcement on what i expect which is why i would like to have friends along with this learning endeavor. i could bounce off of them and help myself by asking such little questions but over the course of asking get solid ideas and solidify my knowledge, without that i fail to retain any info. for example, i have been messing with unreal engine 4 quite alot and have done so for many years. however i couldnt tell you much about vectors, macros, struts, or what it means to initialize or serialize parts of your code. do i know the words? yes but i couldnt even begin to explain it at its most mundane. to cut this very long message short, i am going to give this video course a try, i have very little hope it will stick but im going to play it every single day for as long as i can even on days where im not at my computer to practice. my hope is that maybe by playing it regardless i will be able to memorize the words and the order things are done and maybe start to get a grip on the basics. i was told python is the most basic computer language you can learn so if i cant learn this then i cant learn any of it i would assume. wish me luck guys and i pray that this video will be my breakthrough point.",
    "Thank you!",
    "I am done learning basics of python from this particular video. What should I do next?\nWatch another video of python basics of a different tutor \nOr start with intermediate python video uploaded by freeCodeCamp.\nThanks in advance.",
    "Quick question is punctuation necessary in coding ? Bc when I’m trying the John Example I’m trying to take a short cut and it’s not working it says EOL string literal or sum but do I really need to have precise punctuation to??",
    "Can I use these download and installation guide for Windows also?",
    "In 3:24:02, my code is exactly same with Mike's:\n\nemployee_file = open(\"employees.txt\",\"a\" )\r\nemployee_file.write(\"Toby - human resources\")\r\n\nand my original text file is:\nJim - Salesman\r\nDwight- Salesman\r\nPam - Receptionist\r\nMicheal - Manager\r\nOscar - Accountant\n\n\n\nbut when i run the code, I get 22 as output?\n\nemployee_file.write(\"Toby - human resources\")\r\nOut[56]: 22\n\nCan someone help me? Thanks <3",
    "I sure hope coding is easier then download and opening the different apps cuz I’m already freaking out",
    "THANK YOU!",
    "the 2022 version of Python doesn't need str() function to recognize numbers as strings. You can just create your variables and put your numbers.",
    "I want to use python for web app and for some applications, must I use pycharm professional before I can achieve my goal?",
    "Hello\nMy name is Yiorgos, i am school teacher (primary) from Greece. Because of the epidemie of coronovirus , i 'm staying home and i began to learn Python. Thank you for your great job!",
    "I'm 44 and learning python. I have been scripting for much of my life, but my husband is a programmer, and I know I can learn it. It's never too late to learn something new.",
    "Great work man, I never understood the concept of coding like how i get it now before this video .I am a B.tech(Engineering) graduate and wish if I had a teacher like u in my graduation days I would have done 10 times better in my programing class and project works .Thank you once again",
    "Quick note: On Windows 10 on the command prompt you can write \"python\" to get the python interpreter (currently on Python 3.10.5). Great course man! Thanks a lot! Keep up the good work!",
    "I've learned other programmings languages for a living and this is, by far, the only tutorial that will bring you from literal zero to hero!\n\nYou also show and clearly explain a lot of great practices such as separating your class files and inheritance in python.\n\nKeep up the great work!",
    "You are a legend mike.Never saw anyone teaching and explaining so precisely.Guys just watch this video and practice for like a month to become great at python.Thanks buddy",
    "I'm 2:41:20 into this course, have done ever single tutorial within pycharm, and I won't give up\n\nUpdate: I completed it! I will continue to update my coding journey!\n\nUpdate 10/02/22: I’ve taken what I’ve learned in this video and made my first project; a program that will help me in my job! It’s essentially a multiple choice questionnaire that determines where to transfer a caller based on their responses. Every single question affects where the transferee will end up; it uses a ton of ‘if statements’! I tried to use what I learned with classes, but I couldn’t really figure it out. However, this program works great and if a great first project, I think!\n\nUpdate 10/04/22: I've gone over to freecodecamp and started their course! I started with the top of the list and have made a catphotoapp and a coffee menu. I will keep updating as I go through this course",
    "Hola gente, nada, vine por Dalas y gracias a qué me motivo es la primera vez que estudio programación y mí progeso del curso es hasta 1:40:00 , chicos animensen y la verdad no es dificil, todo con práctica y un poco de estudio se puede. PROYECTO DALAS AQUI VAMOS 💪😁",
    "ive been really interested to start programming but i have no pc wish me luck i will try coding using mobile",
    "was great thank you.\n\n\nlearn free programming in  our channel",
    "you can use python as a calculator",
    "Play this on 1.75 speed it's helpfull",
    "Its a gift to have this course available for free",
    "please do a course on DSA in python and in this darkmode",
    "how i do add the lib extension in vs code? please guide me",
    "New here, after i create \"Hello World\", do i save that? Or do i erase it? If i save it, then open a new project?\n\nPlease help, thanks.",
    "What jobs can you get from learning to code?",
    "Anyone can please write the code for guessing game of numbers as like of string!!",
    "thank you!",
    "Thank you.",
    "we need an update if also you can do it on something other than mac. super nice to follow but im having trouble with selecting the interpreter i feel stupid not knowing how to select it but it doesnt even show up",
    "if (ball.xcor() > 340() and ball.xcor() < 350) and (ball.ycor() < paddle_b.ycor() + 40 and ball.ycor() > paddle_b.ycor() -40): isn't working",
    "Can anyone explain why \"not(out_of_guesses)\"? All I know is \"not false= true\". Thank you",
    "I believe I can fly now. Thanks to you guys.",
    "Thank you bro",
    "for myself to keep track \nday1: 1:55:12",
    "Hi I have a quick question if you could please answer me.. I have an electronics engineering background.. would that be an hinderance while learning python..since I feel a computer science engineering background is more favouring?",
    "thanks bro now i can finally play scratch",
    "Mike, you have a gift of explaining Python programming in an \"easy to understand\" and \"easy to follow\" approach. I so appreciate your video tutorial. I can easily understand python concepts you cover in this tutorial and apply them in my practice. Thanks so much!!!!",
    "Thank you for this video! After watching this as a total beginner, I challenged myself to code a score-tracker for one of my favourite card games. It took 2 days of trial and error, but I finally managed to code it!",
    "This course is whole lot awesome. I always wanted to learn a programming language, and Mike made it easy for me. Finished learning 4 and half hours python basics. Now, I need to step to next levels. Thank you Mike",
    "You are a really good teacher. You have a gift to simplify concepts, explain clearly and show them in a way that facilitates natural learning. \nI also really enjoyed your simple yet effective examples, they are excellent for learning (and very bespoke to you). \nIt would probably be great if there is part-2 of this video or series to continue the learning journey. \nThanks again for the awesome course... .much appreciated. Keep up the good work.",
    "Just wrapped this up. Followed right along, fixed all my errors and I feel like I'm ready to try a simple project. I'm also pumped to keep learning. Thanks!",
    "This has been an amazing course to really get started in understanding the language where I can progress with more specific areas. Very easy to follow along and understand! Thank you!",
    "I just finished the whole thing - great video, it helped a lot! Although,  just for future reference, it's a lot clearer when you don't use similar/same names for both a class and the name of a file. For example, I just found it very confusing in the 'building a multiple choice quiz' tutorial as you use the same name for the file name and the class. Another thing that confused me was when you would do certain things and not explain them (probably because it's so natural to you) - but to a newbie it's tough trying to figure out how one thing relates to the other in regards to the entire programme, you certainly explained things very well and made it much easier to understand, but there were a few times when you'd do something and skip over the explanation and as a Python coding beginner it feels necessary for every little thing to be explained (in my opinion). But other than those 2 minor things this was extremely helpful so thanks a lot for the video and the effort that you put into making it, we really appreciate it man! :)",
    "I absolutely love this so far. Only 15mins in and I've grasped the basics. Love how you literally explain *everything* step by step, so that absolutely *anyone* regardless of their career field or skill set can understand.\nI'm hoping to learn coding and if I enjoy it, then step into a new career in programming, doing something fulfilling not only for myself but also helping wider society. (I feel a bit like Aloy from the Horizon games fiddling around with machines! 😆)\nThank you so much for sharing this 💙. Cannot wait to see all the other vids.\n*Goes back to watching*",
    "Can't express enough how much I appreciate people like you for making these free, well done tutorials. Really got me started man",
    "It took me ages to do the easy (variables and data types) tutorial just because it did not concatenate. I had to put an str in front of the age variable. I didn't know that because you did not explain it and beccause it worked for you i assumed it would for me but it didn't. maybe its because i have a newer python.10 or something. omg i am so pissed.",
    "can this be used for game develpment",
    "at 50:38 I tried to follow the tutorial and it said hi pycharm instead of enter your name. What could be the problem ? someone please help me",
    "its cool but cant we try guess_word game in for loop style can u send me a code snippet for me",
    "guys i have a doubt i want to develop a website but by seeing his tutorial should I copy exactly what he wrote in this video ???",
    "Notes\n\nA string is a line of code surrounded by speech marks \"like this\"\nthey will be counted as words. \nA number does not get surrounded with speech marks.\nyou can do calculations with them (e.g print (2 + 4) = 6)\nA boolean is like a switch- it's either true or false.\nfunctions do mabye specialized calculations or just random useful cool things like\nphrase.lower() = turns all the string characters in the phrase variable to lowercase\nphrase.upper() = turns all the string characters in the phrase variable to capital letters\nphrase.islower() = returns with true or false\nphrase.isupperr()= returns with true or false\nand phrases can be chained like this:\nprint(phrase.upper().isupper()) = true\nthe len(length) function: searches how many characters are in the specified string.\nprint(len(phrase))\nanother cool function:\nprint(phrase[1]) prints the first character in the phrase variable\nprint(phrase.index(\"s\")) tracks where the \"s\" is in the phrase variable\nhow to convert a number to a string: print (str(123123)) = \"123123\"\nhow to do it the opposite way: int() or float() if you're working with decimals\n\nfor cool maths functions:\nfirst import the maths module : from math import *\nand you can use things like \nsqrt()= square root\npow(231,1344) multiplies 231 by the 1344th power\nabs= absolute value= turns negative numbers into positive ones\nmin(1231,1254) in this case, it finds out what the smaller number is\nmax(1231, 1254) is the opposite\nround() rounds\nfloor() rounds down\nceling() rounds up\n\ngetting input:\nworks like this : input()\nyou can set it to a variable.. x =input(\"blah blahg blag\")\n...or just to a print funtion\n\nthen these variables can be used with other strings in a print function: print (\"hi i could tell your\" + x  +\"was blah blah blah\")\nbut if you're working with numbers, you can change then to numbers with str(input())\n\nlists\n\nlists can be made like this: sdfadf = [\"something\" , \"something\" , \"etc\"]\nhow to extract items from a list? like this: sdfadf[number]\nif you put a negative number, the sorting will start from the end of the list\nlist.append() adds an item to the end of the list\nlist.insert(something,number) inserts something in the xth position in the list, pushing other items back\nlist.remove() removes specified item from list\nlist.clear() removes all items in list\nlist.pop() removes the last item in the list\nlist.index() finds&locates an item in a list then finds its item number\nlist.count() counts how many of something is in a list\nlist.sort()sorts numbers from small to big\nlist.reverse() reverses the items in a list\nlist.copy() copies all the contents of a list  to something else\n\ntuples\nlike a list, but immutable.\ntuples can also be in a list: list=[(1 , 3) 3]\n                                                          tuple\n\nfunctions\nlike a bunch of specific lines of code, in 1 function\nexample:\ninput\ndef sayhi(name, age):\n       print(\"hi \"+ name + \" \" + str(age))\nsayhi(Nick, 47)\n\noutput\nhi Nick 47\n\n\n\nreturns in functions\nreturns in functions kind of produce an output that can be printed or stored in another variable/list or smth\neg:\ninput\n\ndef cube(num):\n           return pow(num, 3) #just put return in front of whatever code you have\n           print(\"hey\")\nresult=cube(5)\nprint (result)\n                   \noutput\n\n125\n\nnotice the hey str didn't get printed, reason is the return cuts off all the code after that return.\n\n\nif statements\nfor this, i wrote a little fun script.\ninput:\n\ngender=input(\"are you a male or not? y/n \")\r\ntall=int(input(\"how tall are you? (cm) \"))\r\nif gender==\"y\":\r\n    is_male=True\r\nelif gender==\"n\":\r\n        is_male=False\r\nif tall>=180:\r\n    is_tall=True\r\nelse:\r\n    is_tall=False\r\n\r\nif is_male:\r\n    q1=\"Your a male bro\"\r\nelse:\r\n    q1=\"your not a male bro\"\r\nif is_tall:\r\n    q2=\"hows life up there in the sky\"\r\nelse:\r\n    q2=\"hows life as a 4\\\"11 kid\"\r\nprint(str(q1)+\" also \"+str(q2))",
    "Hi , I am interested in programming but I don't know about it and totally don't know what to do and where to start.\ncan anyone guide me what to do ?",
    "python is great and the scripts help me out so much but its useless without knowledge in something else",
    "0:00 introduction\r\n1:45 installing python and pycharm\r\n6:40 setup and hello world\r\n10:23 Drawing a shape\r\n15:06 Variables and Data types\r\n27:03 Working with strings\r\n38:18 Working with numbers\r\n48:26 Getting input from users\r\n52:37 building a basic calculator\r\n58:27 Mad libs Game \r\n1:03:10 Lists \r\n1:10:44 List Functions \r\n1:18:57 Tuples \r\n1:24:15 Functions \r\n1:34:11 Return statement \r\n1:40:06 If statement \r\n1:54:07 If statements and comparisons \r\n2:00:37 Building a better calculator \r\n2:07:17 Dictionaries\r\n2:14:13 While loop\r\n2:20:21 Building a Guessing game\r\n2:32:44 For loop\r\n2:41:20 Exponent Function \r\n2:47:13  2D lists and nested loop\r\n2:52:41 Building a Translator \r\n3:00:18 Comments \r\n3:04:17 Try/Except \r\n3:12:41 Reading Files \r\n3:21:26 Writing a file\r\n3:28:13 Modules and pip \r\n3:43:56 Classes and Objects \r\n3:57:37 Building a Multiple choice quiz\r\n4:08:28 Object Function \r\n4:12:37 Inheritance \r\n4:20:43 Python interpreter\r\n\n:)\n\nplz\n\n👇",
    "hey for me im not able to use .extend feature",
    "thank you",
    "Thanks For Turkish Subtitle.",
    "Can I learn this on my android phone ?",
    "I’m a college freshman (junior in credits) and this semester I enrolled in the intro to computer science course. I’ve always been good in math and science and have been interested in technology but never really got around to figuring out hardware or software. In my college intro to programming source I found that I really enjoyed the basics I’ve learned in just one week. I ended up doing a bunch of stuff and got 3 weeks ahead in the course. I just found this video and now I see that it teaches almost everything that is mentioned in the syllabus for the class in just 4.5 hours. I haven’t watched all of it yet, but 45 minutes in and I’ve already seen everything I’ve already figured out to get 3 weeks ahead in my class. I’m excited to watch the whole video and get comfortable with python. Maybe I’ll major in computer science instead of aerospace engineering 😂",
    "How ! really nice video.. Really well explained. I'm not an english native speaker but you speak clearly and i can fully understand you without any subtitles. I really congratulate you for this incredibly nice video.",
    "I'm a total beginner to programming/coding and this video really helped me out. Thank you!",
    "I HAVE INCURRED SO MUCH LOSSES TRADING ON MY OWN...I TRADE WELL ON DEMO BUT I THINK THE REAL MARKET IS MANIPULATED... CAN ANYONE HELP ME OUT OR AT LEAST TELL ME WHAT I'M DOING WRONG ?",
    "Incredible tutorial! AND SHOUTOUT TO EVERYONE LEARNING HOW TO CODE DURING QUARANTINE, GOOD JOB GUYS :D",
    "I am breaking this course out in 30 minute sessions so I can sufficiantly absorb it all. Very clear and practical information without slipping into a teacher hole where we lose you. Very grateful for this video. Round of applause from me. Hopefully this changes my life as much as all of yours! Best of luck and may our New Years Resolutions come to bear.",
    "Almost halfway through. I expect a cal from OpenAi any minute now asking for my help on Gpt-5",
    "I want to learn python because I don't like my current job and i want to make cool stuff with it like games , apps and other stuff  so downloaded this video so I can watch it offline , I'm also curious about how I should learn with this tutorial should I watch the whole video without doing anything or watch and doing it in the same time...",
    "#1 Homie right here. Thank you brother man.",
    "hey...i just found this in youtube. i went to jetbrains and coudnt find the community version. can anyone help to find it or where to find it to download it please?",
    "I'm gonna try learning this in 15 days I'm just gonna try if i can do it",
    "i need help it wont let me download pycharm because im on chrome, what do i do?????",
    "Who said you can't teach old dogs new tricks? After being frustrated by seeing many jobs in my field required programming skills, I picked up Python today. If you can't beat them, join them!",
    "how do you make a new line?",
    "You have single handedly inspired me to take coding serious. I just finished this video which took about a month because I wanted to really understand the info you were teaching. The way you explain everything is better than any other video i've watched. Thank you!!",
    "I bought a Udemy python course.. In order to stay ahead i would watch videos about python programming whenever im not studying. This channel has put me so ahead that by the time i move on to the next chapter i already know how to solve the assignment. \n\nThank you guys so much for taking the time to make courses like these :)",
    "*Hands down* this was one of the simplest, easiest to understand, and most helpful guides on youtube I've ever watched. I dowloaded the Python programs he did, and followed along, watching segments of the video day by day, and it helped so much. *THANK YOU SO MUCH* for making this",
    "God bless you for sharing your knowledge. Much appreciated for simplifying Python for us beginners",
    "Thank you Mike Dane,\nJust coming on board and ready to learn.\nI like your teaching style!",
    "Thank You so much for this man!\nnot only did I learn Python, but you also answered my questions on the basics of other programming languages!",
    "Oh my god I was failing my computer science class and had very crappy teachers who barely explained anything to us. Thank you for this it’s helped clear things up a lot 🙌",
    "LEARN PYTHON ON 4:26:52\nME: sets the video in 2x speed...",
    "⬆️⬆️⬆️ el es la solucion a tu problema, puedes ver muchas recomendaciones sobre el no permitas que nadie te engañe, mandale un mensaje que te ayude..",
    "For detailed videos on python topics, you can refer to https://www.youtube.com/c/FunCodingwithRahul/videos",
    "This course really has been an extremely easy way to learn python - I have touched on other programming languages in the past  like Java and C#, and it just seems so much simpler to use and a lot more modern. Thanks for the video, it really helped me learn the core aspects of Python extremely quickly and easily!",
    "*For repetition (2:39:30)",
    "SIMPLE FOR YOU BuT how we know to put Commands like PRINT phrase “””” /// we son t know what this charactera do and when to put them.  You don t explain us the commands",
    "Sir this is core or advanced pythone please replay me sir please sir",
    "I DIDNT UNDERESTAND THE PURPOSE OF TRUE OR FALSE DATA VARIAB;E ,, PLZ HELP ME !!!",
    "i am chemist and i want to become proggramer,can i learn paython without any knowlage of programming language.\nif some one is like me non technical background and become programmer give me refferance",
    "Great tutorial, thanks!\n\nAlso, in the section \"(3:28:13) Modules & Pip\", Window users on Python 3 (and 2?) may not be able to use \"python\" or \"pip\" via the command prompt that way you demonstrated to us. \n\nFor those experiencing this issue, open up your command prompt, then first type in \"python -m\", then type the rest in. So for example in Mike's tutorial to install python-docx:\npython -m pip install python-docx\n\nHopefully that helps!\n\nOn a side note: \nI installed Python 3.7.2 (up to date as of this comment), and it didn't have the most up to date pip. So to update your pip (which may or may not fix this issue. It didn't for me, unfortunately), make sure you add \"python -m\" before typing in anything else:\npython -m pip install --upgrade pip",
    "Thanks for teaching us this \nvaluable information for free.\nAppreciate it.",
    "⬆️⬆️⬆️ el es la solucion a tu problema, puedes ver muchas recomendaciones sobre el no permitas que nadie te engañe, mandale un mensaje que te ayude..",
    "HOW DO YOU MAKE  AVERTICAL LINE ON A GAMING KAYBOARD",
    "A college student taking a intro to python course. I need help can anyone point me into the right direction",
    "Not me doing this on my school computer hehe😂",
    "Wanting to make a switch from construction to coding. Tired of being on the road away from my family... just need to make good money",
    "I’m turning 94 I’m learning new things",
    "how does he type () with one click",
    "watch (53:10)",
    "When you pop Toby out of the list @1:15:39 I imagine Michael Laugh in the background"
]