{
    "1": "I learnt python from this video last year. I cleared two interviews in python this year and I am in a new job. Thank you ☺️",
    "2": "Want more from Mike? He's starting a coding RPG/Bootcamp - https://simulator.dev/",
    "4": "Absolutely insane that we live in an age in which we can learn an entire programming language - FOR FREE - online.",
    "7": "I had to come here - 8 months after I watched your video. I studied economics, last year of masters. Nothing to do with coding whatsoever. Then I watched this video. Now I'm 8 months to python and Django. Just got my first paid software developer job. You have completely changed the course of my life and I'm thankful for that. First time in my life I like my job. I think you can live freely because you changed someone's life, it is almost like if you gave Dobby a sock. Keep it up and thank you.",
    "10": "This dude really taught me HTML, CSS, C++, R and Python. What a legend.",
    "36": "When I got to the translator, I made a pig-Latin translator program that converts English to pig-Latin using everything I learned so far. Dictionaries, functions and for and while loops. Some stuff I had to look up when I was trying to do string and list manipulation, like .append(), but I knew the fundamentals because of you. Thanks Mike! I hope to go further with python because I had a great idea that has potential for $$$, so thanks for setting me down this path. Hope to take programming into a career in mechatronics as well.",
    "38": "I really like and appreciate the video. \n\nI was having some error messages when working on classes towards the end, I’ll figure it out though. But this has been very useful overall. I’m trying to learn Python. It’s the first coding language I’m getting into.",
    "50": "You are awesome.  You make things look easy. I like to thank you for making a dry subject to most people seem like ice cream in the heat of the summer . I'm 74 years old . I worked in NASA in the seventies in the last appollo trip then the oil industry . Using Fortran,  plm86 , and assembly language.  In 1984  left the field (a mistake) n went to sales. Now I'm raising my grand children\nand I need to work. I have degree in math n physics. I don't know what will be the area that I should approach aerospace  . Is python used in engineering applications.  Or should I learn different language. Any advice ?",
    "62": "Thank you so mush for this free course it really helped me!",
    "66": "freeCodeCamp I love the work you guys are doing to this community\nremember my words. with these courses which you guys provide me for free i am learning a lot and i am hoping that i will be a developer one day. When i earn money you guys will be the first  place for me to donate.\nThanks for your service once again\ncheers !",
    "90": "Am grateful for this tutorial even though I haven't done anything yet besides downloading python and pycharm. I'm a second year electrical engineering student but want to become a programmer, you've got a new subscriber. Looking forward to learning more and more new tutorials. Thanks",
    "100": "Several weeks ago I commented that I was a few days away from turning 73 and I was learning Python.  I was overwhelmed at the likes and replies given my post.  Thank you all so much.  Some even replied with a 'birthday wishes' Python program.  I have tried many times to like all the replies, but as I continue to click 'Review replies', YouTube eventually reloads.  I apologize that I cannot like every reply.  A few asked why I was learning Python at my age.  I'm still working full time, and I believe new skills are always good.  Others asked how my learning was goin.  I watch some of the video, then practice to determine how much I have learned then watch more and practice. My goal is Python certification.  Again, thank you all for your support.",
    "112": "This is the very first 4.5 hr long youtube video that I watched from start to end without skipping in my life. Thanks for your hardwork.",
    "115": "the amount of effort put into this FREE course deserves the attention its getting and more",
    "123": "Hello guys, i am in vacation from school, waiting to start the college, so i decided to learn programming and thats how im starting. I want to end the video in 4 days max and then start to practice! Hope u guys start doing this too.\n\r\nDay 1 of learning Python: 1:03:41 (Lists) - I wanted to start with 1h and half but thats no problem, i think it was a good beginning, im writing the new thing in an note and practicing with the pycharm. Good first day and i hope this comment help me to be more focused, cya tomorrow.\n\nDay 2 of learning Python: 2:00:37(Building a better calculator) - Second hour done, ok i finished it at 23:58 but nevermind, i did it, and i will do even better tomorrow if i get the mark i need in an exame, so, my free time depends on it. Anyway, i have the sensation that im learning the content and i still focused on finishing the video in more 2 days(this comment helped a lot btw). Hope u guys who commented are having progress too, cya tomorrow.\n\nDay 3 of learning Python:  2:00:37(Building a better calculator) - Yeah, i did nothing today xD, relaxing day.\n\nDay 4 of learning Python: 3:12:43(Reading files) - Another hour! i was not inspired to study today, but i reached the third hour and will finish this tomorrow. Im liking the course, its just a little hard to me to be focused for long periods of time, but im getting better. Python is very clean to work, compared to c#, really.\n\nDay 5 of learning Python: I did it! I learned the basics of python in 5 days, im really proud of myself for doing some productive stuff in vaction. Actually, i really liked this professor, his objective way of teaching turned it way more easy. I want to practice now and continue my coding journey. I hope this comment have been helping someone, it made me more focused because i did not want to leave the impression that i forgave and went down due to procrastination. Anyway, thanks Mike! (Sorry for any english mistake, thats not my native language).",
    "133": "Hey @swallowedinthesea11, thank you for helping people in the comments box. I have a query too, this is my first video into coding. Python is the first language that I'm learning. I would like to know which course/video should I watch to progress after completing this. Thank you!",
    "145": "4:20:43 For Windows interpreter, you just have to type in \"python\" not \"python3\"",
    "160": "Loved your training video with one exception. You made it sound simple to download PyCharm as a text editor, and when I did so IT WOULD NOT RUN because it asked me what version of Python I was using, and no matter what I entered it said, \"Not valid . . . please enter a valid version if Python. I worked on for almost 3 hours, trying everything, but it never opened not even once. I wrote them and email, but no response. So if you want to advise using PyCharm, please tell us how to work around this obstacle. I\"m using Python 3.10.7. Thanks Jeff Boyd",
    "161": "Gracias Genio!, siempre tuve curiosidad sobre programación, pero nunca me senté a leer nada porque no sabia por donde empezar.. hasta que di con este video y ahora mi hobbie es aprender programación jaja",
    "176": "If you want to learn, build the programs and then watch his examples to compare...unless you just don't know the code, but farther in its possible, and will help you learn a lot more. Great videos, thanks!",
    "183": "Watching your video from india . and i am really happy to after watching your tutorials . because i explore so many videos in youtube but no one can explain like you. You really explaining very clearly and perfectly . thank you so much",
    "186": "Yo thank you so much for this, in 2 days I completed the course and i’m going forward to more complicated stuff, thank you for doing this such a clear and understandable video :))",
    "210": "I'm an intermediate at programming and watched MANY videos.  This one is BY FAR the best explained and easy to follow for a TRUE beginner.",
    "223": "1:33:00 - worth pointing out that you can explicitly assign parameters, e.g. def f(a,b): when called can be f(b=2,a=4)",
    "227": "I am a father of 9 soon to be 10. I am a cnc set up machinist. I have been looking at learning programming for a while now, I seem to always find some lame excuse not to though. I'd like to learn with goal of being to work some, if not all of my time from home. I also believe programming will allow the opportunity to earn more and give my family the breathing space financially to do things we can all enjoy. So, any advice and suggestions thrown my way will always be gratefully received. Thank you for reading my ramble. Also, good luck to all those reading this who are at the same stage of the journey as I am.",
    "231": "Me gusta mucho el vide no se nada sobre esto estoy intentando aprender por mi cuenta 😅 aunque no entiendo muy bien ya que la traducción automática de español no traduce muy bien que digamos",
    "233": "I started learning coding from your video and I have something that is confusing me. in 1:33:10 \nWhy do we have to put the numbers 35 and 70 into strings in order to make the function work? subbed to your channel btw. thanks",
    "242": "Thank you for the video. I'm starting to learn Python after knowing how to work with RStudio.",
    "272": "im relearning python right now so when I transfer to university, I won't struggle as much. Thank you for these tutorials! they are a life saver",
    "286": "Wow thank you so so much\nThis channel is the best\nI can't believe This is free \nI learned so much",
    "292": "hi i am a begginer with no experience in my backround in this field,  i like your courses, the simple indication and i really want to learn about coding. My big question here is how to have a job in this field?  I want to learn from your courses ( i want to tell that i learn alone from zero and i have my mind open for new and improving myself after i learn the basic and get a job hopefully.",
    "306": "Respect to you for providing this and doing so without any gain from ad revenue.",
    "312": "Such a fresh and great content. I'm not a programmer but I started to do data analysis in my job and your videos help just amazingly, I can understand the different components perfectly. Watched other videos from other sources but they were a little hard to understand. Thank you very much for this, your channel is amazing",
    "319": "cool text based gun handling sim I made (longest code yet)\ntype:\nshoot : to shoot (can only do so if the safty is off and the chamber is loaded)\n0/1/2: 0 for safe/ 1 for semi / 2 for full auto(just empties the gun) \ncycle bolt : used in reloads to charge the handle\nremove mag : removes magazine\nreload mag : fills up the magazine (can only do so if the mag is removed)\ninsert mag : inserts magazine into the gun\ncheck mag : to see how many rounds you have\ncheck chamber : to see if you are ready to shoot \nto reload the sequence would be\nremove mag  reload mag  insert mag  cycle bolt\ncode:\nans = 0\r\nin_chamber = False\r\nmag_in = True\r\nrounds_in_mag = 30\r\nwhile ans != \"exit\" :\r\n    ans = input (\"enter command(: \")\r\n    if ans.upper() == (\"CHECK MAG\"):\r\n        print (rounds_in_mag)\r\n    if ans.upper() == (\"CHECK CHAMBER\") :\r\n        if in_chamber :\r\n            print (\"live one in the chamber\")\r\n        elif not(in_chamber):\r\n            print (\"no live round in chamber\")\r\n    if ans.upper() == (\"0\"):\r\n        fire_mode = 0\r\n    if ans.upper() == (\"1\"):\r\n        fire_mode = 1\r\n    if ans.upper() == (\"2\"):\r\n        fire_mode = 2\r\n\r\n    if ans.upper() == (\"SHOOT\") :\r\n        if in_chamber and mag_in == True and fire_mode == 1:\r\n            if rounds_in_mag > 0 :\r\n                print(\"bang(round ejected and new one chambered)\")\r\n                rounds_in_mag = rounds_in_mag - 1\r\n            elif in_chamber and rounds_in_mag == 0 :\r\n                print(\"bang(round ejected but now your dry)\")\r\n                in_chamber = False\r\n        elif in_chamber and mag_in == False and fire_mode == 1 :\r\n            print (\"BANG(round ejected but you chambered nothing since mag is out)\")\r\n            in_chamber = False\r\n        elif not(in_chamber) :\r\n            print(\"click(must chamber a round first)\")\r\n        if fire_mode == 0 :\r\n            print (\"cant shoot if safty is on\")\r\n        if in_chamber and mag_in and fire_mode == 2 :\r\n            if rounds_in_mag > 0:\r\n                while rounds_in_mag != 0 :\r\n                    print (\"bang\")\r\n                    rounds_in_mag = rounds_in_mag -1\r\n                print(\"mag emptied\")\r\n                in_chamber = False\r\n            if rounds_in_mag == 0 :\r\n                print (\"bang(round ejected but now your dry)\")\r\n                in_chamber = False\r\n        elif in_chamber and mag_in == False and fire_mode == 2 :\r\n            print (\"BANG(round ejected but you chambered nothing since mag is out)\")\r\n            in_chamber = False\r\n        elif not(in_chamber) and fire_mode == 2 :\r\n            print(\"click(must chamber a round first)\")\r\n\r\n\r\n\r\n    if ans.upper() == (\"CYCLE BOLT\") :\r\n        if in_chamber and mag_in :\r\n            if rounds_in_mag > 0 :\r\n                print(\"ejected round and chambered new one\")\r\n                rounds_in_mag = rounds_in_mag - 1\r\n                in_chamber = True\r\n            if rounds_in_mag == 0 :\r\n                print (\"gun emptied\")\r\n                in_chamber = False\r\n        if not(in_chamber) and mag_in:\r\n            if rounds_in_mag > 0 :\r\n                print(\"round cycled in(ready to shoot)\")\r\n                rounds_in_mag = rounds_in_mag -1\r\n                in_chamber = True\r\n            if rounds_in_mag == 0 :\r\n                print (\"nothing chambered since mag is empty\")\r\n                in_chamber = False\r\n        if in_chamber and not(mag_in):\r\n            print(\"round ejected gun empty\")\r\n            in_chamber = False\r\n        if not(in_chamber) and not(mag_in):\r\n            print (\"nothing happened since no mag in and chamber empty\")\r\n    if ans.upper() == (\"RELOAD MAG\") and not(mag_in) :\r\n\r\n        rounds_in_mag = 30\r\n    elif ans.upper == (\"RELOAD MAG\") and mag_in :\r\n        print (\"must remove mag from gun to fill it up\")\r\n    if ans.upper() == (\"REMOVE MAG\") :\r\n        if not(mag_in):\r\n            print(\"mag already out\")\r\n        mag_in = False\r\n    if ans.upper() == (\"INSERT MAG\") :\r\n        if mag_in :\r\n            print (\"mag already in\")\r\n        mag_in = True",
    "322": "Hi, thank you from India. Contributed what I could just as a token. Hope you get all the success and light in life. Thanks ",
    "331": "How does this course compare to the 12 hour Python course here? https://www.youtube.com/watch?v=XKHEtdqhLK8\nBig thanks to creators of both video, just curious which one I should watch.",
    "334": "Hello, im 13 and i live in pakistan. I would like to ask that im tryna learn coding but the thing is that there are some parts that contains math which i havent studied yet. Any suggestions on what i should do?\n~thanks",
    "347": "But to add the character name, you still had to manually change all the John to the character_name variable.",
    "358": "easy to follow 👍",
    "369": "is concatenation also called an expression? or is this different?",
    "375": "Thanks for helping me recall python",
    "390": "Did you try to run the program after you changed the variable type to an int? @25:28  I have an error, \n\nTypeError: can only concatenate str (not \"int\") to string.",
    "402": "For those who are completely newbiee  and ran into this tutorial . This video is the most simplified and meanwhile comprehensive   Python Tutorial in whole web ( Mosh Tutorial is also awesome) . I'm saying that after watching thousands videos  . I think the best way you can learn Python is first watch this video  2 times . and for the third  time ,  there is list of contents copy and paste every topics on google and start to read every blog post ( this takes almost 3 months) meanwhile start to write simple code ...   5 months in ,you know enough \"\"to become danger \"\"\"",
    "404": "17 and learning to code to make some indie one off games! Got ADHD, so having a hard time focusing, but REALLY determined to do this! Thanks for all the help so far!",
    "409": "He taught all the concepts so nicely and thoroughly that I was able to make the advanced calculator all by myself",
    "410": "For those just starting this, I'll note that for Windows users (and maybe this was an issue before but I'm just putting python on a new comp) by default \"Add Python to Path\" is no checked by default on installation. You are almost certainly going to want to check this box before installing. Later in the video (in the Modules and PIP) section, you'll encounter some confusion when trying to follow along here.",
    "412": "Lifehack: Once you learn how to make a Multiple Choice Quiz, make one to test yourself on everything you've learned in this video! I plan to do that soon and figured it would be a cool thing to share and may help some people! Thank you for the amazing course, Mike.",
    "414": "I had always avoided python because I thought it was too difficult. Other videos left me feeling confused and frustrated. Mike changed my entire perception of python and coding in general. Thank you, Mike. I cannot thank you enough!",
    "418": "can I just say, you are a genius. I'm 14 and u have helped me figure out coding, I am doing a project at school and I've been really stuck on it, this video is exactly what i was looking for and the question was about riddles \nonce again thank you so much. I'm going to share this video with people in my class cuz this helped me understand",
    "419": "Now I am trying to learn Python theoretically without practical application Because I couldn't get enough money to get a laptop😔\n I'm so frustrated Please pray for me that I can buy one",
    "423": "Thanks brother\nI have started leaning from this video",
    "429": "Can someone tell me how he gets those brackets to appear after the word Print?\n\nIs it a keybind via settings or pressing buttons on the keyboard?\n\nThank you.",
    "438": "Can i use VS code.  And also I love this channel so if your new to the channel don't sweat it it is totally worth it😀",
    "444": "i can t believe learning something like this is free",
    "458": "In the return statement if you type\nprint(num*num*num) \nAnd then if you put  cube(3) \nIt will get the result 37 \nAm i right brother 😃",
    "468": "Thanks for this freecodecamp",
    "471": "i am going to give this course a try. i am very new to programming in terms of experience, granted i have been playing around in unity, unreal 4, and others for a long LONG time now but i have never been able to get going because i lack the focus and the ability to sit with it all the way through. problem one being i have no one to learn with and thus i feel as if my goal to learn is pointless? whats the point in me learning if i have no friends that i can learn with or talk to during the process? i have no one that shares the interest in my life so why must i dedicate all of my time learning what is essentially a waste of my time? i am well aware that i am wrong, i am well aware that this train of thought is common and is a reason why many people struggle and or fail to ever catch on and i have heard all of the same encouraging themes before such as \"dont let their absence stop you from learning something new\" or \"you can do it and excel if you just put in the time\"... my other problems are that my brain likes to know WHY alot. WHY is it we are typing code a certain way? WHY do we have to put the code in this area when it would work just as well 10 or so lines up? and you see this causes me issues because when im not being told WHY we are doing something in a certain way or why something is the way that it is my motivation shuts down because im not getting that reinforcement on what i expect which is why i would like to have friends along with this learning endeavor. i could bounce off of them and help myself by asking such little questions but over the course of asking get solid ideas and solidify my knowledge, without that i fail to retain any info. for example, i have been messing with unreal engine 4 quite alot and have done so for many years. however i couldnt tell you much about vectors, macros, struts, or what it means to initialize or serialize parts of your code. do i know the words? yes but i couldnt even begin to explain it at its most mundane. to cut this very long message short, i am going to give this video course a try, i have very little hope it will stick but im going to play it every single day for as long as i can even on days where im not at my computer to practice. my hope is that maybe by playing it regardless i will be able to memorize the words and the order things are done and maybe start to get a grip on the basics. i was told python is the most basic computer language you can learn so if i cant learn this then i cant learn any of it i would assume. wish me luck guys and i pray that this video will be my breakthrough point.",
    "474": "I am done learning basics of python from this particular video. What should I do next?\nWatch another video of python basics of a different tutor \nOr start with intermediate python video uploaded by freeCodeCamp.\nThanks in advance.",
    "480": "Quick question is punctuation necessary in coding ? Bc when I’m trying the John Example I’m trying to take a short cut and it’s not working it says EOL string literal or sum but do I really need to have precise punctuation to??",
    "503": "I'm 44 and learning python. I have been scripting for much of my life, but my husband is a programmer, and I know I can learn it. It's never too late to learn something new.",
    "513": "You are a legend mike.Never saw anyone teaching and explaining so precisely.Guys just watch this video and practice for like a month to become great at python.Thanks buddy",
    "515": "Just wrapped this up. Followed right along, fixed all my errors and I feel like I'm ready to try a simple project. I'm also pumped to keep learning. Thanks!",
    "516": "The reason your class is so informative as well as keeping my attention is due to the fact that although you are teaching things that are so incredibly simple to you, you are very passionate towards it all. Your as excited teaching others as others are learning. This is a quality most teachers lose. Well done friend!",
    "519": "Hola gente, nada, vine por Dalas y gracias a qué me motivo es la primera vez que estudio programación y mí progeso del curso es hasta 1:40:00 , chicos animensen y la verdad no es dificil, todo con práctica y un poco de estudio se puede. PROYECTO DALAS AQUI VAMOS 💪😁",
    "533": "was great thank you.\n\n\nlearn free programming in  our channel",
    "541": "Play this on 1.75 speed it's helpfull",
    "542": "Its a gift to have this course available for free",
    "550": "Hello guys. I'm new here never experienced programming, should i start learning python first?",
    "553": "New here, after i create \"Hello World\", do i save that? Or do i erase it? If i save it, then open a new project?\n\nPlease help, thanks.",
    "591": "I believe I can fly now. Thanks to you guys.",
    "594": "for myself to keep track \nday1: 1:55:12",
    "597": "thanks bro now i can finally play scratch",
    "600": "Mike, you have a gift of explaining Python programming in an \"easy to understand\" and \"easy to follow\" approach. I so appreciate your video tutorial. I can easily understand python concepts you cover in this tutorial and apply them in my practice. Thanks so much!!!!",
    "626": "at 50:38 I tried to follow the tutorial and it said hi pycharm instead of enter your name. What could be the problem ? someone please help me",
    "645": "This is the video where life change",
    "679": "hey for me im not able to use .extend feature",
    "699": "Almost halfway through. I expect a cal from OpenAi any minute now asking for my help on Gpt-5",
    "703": "I’m a college freshman (junior in credits) and this semester I enrolled in the intro to computer science course. I’ve always been good in math and science and have been interested in technology but never really got around to figuring out hardware or software. In my college intro to programming source I found that I really enjoyed the basics I’ve learned in just one week. I ended up doing a bunch of stuff and got 3 weeks ahead in the course. I just found this video and now I see that it teaches almost everything that is mentioned in the syllabus for the class in just 4.5 hours. I haven’t watched all of it yet, but 45 minutes in and I’ve already seen everything I’ve already figured out to get 3 weeks ahead in my class. I’m excited to watch the whole video and get comfortable with python. Maybe I’ll major in computer science instead of aerospace engineering 😂",
    "708": "I HAVE INCURRED SO MUCH LOSSES TRADING ON MY OWN...I TRADE WELL ON DEMO BUT I THINK THE REAL MARKET IS MANIPULATED... CAN ANYONE HELP ME OUT OR AT LEAST TELL ME WHAT I'M DOING WRONG ?",
    "731": "i am not able to install pycharm ..it says the image is corrupted whem i run dmg file ...pls help",
    "735": "I want to learn python because I don't like my current job and i want to make cool stuff with it like games , apps and other stuff  so downloaded this video so I can watch it offline , I'm also curious about how I should learn with this tutorial should I watch the whole video without doing anything or watch and doing it in the same time...",
    "742": "#1 Homie right here. Thank you brother man.",
    "746": "hey...i just found this in youtube. i went to jetbrains and coudnt find the community version. can anyone help to find it or where to find it to download it please?",
    "767": "i need help it wont let me download pycharm because im on chrome, what do i do?????",
    "772": "There is a new Version 3.10.5 will this video still work?",
    "781": "how do you make a new line?",
    "804": "I just had python in my last semester.... but this video taught me the actual reason behind each command that I type!!!! Keep Up The Good Work brother...;)",
    "807": "I bought a Udemy python course.. In order to stay ahead i would watch videos about python programming whenever im not studying. This channel has put me so ahead that by the time i move on to the next chapter i already know how to solve the assignment. \n\nThank you guys so much for taking the time to make courses like these :)",
    "824": "the The Office references make me happy",
    "826": "⬆️⬆️⬆️ el es la solucion a tu problema, puedes ver muchas recomendaciones sobre el no permitas que nadie te engañe, mandale un mensaje que te ayude..",
    "831": "2:16:40  why can't we just type i++ or i-- ?",
    "840": "For detailed videos on python topics, you can refer to https://www.youtube.com/c/FunCodingwithRahul/videos",
    "868": "Someone help open(„abc.txt“, „r“) doesnt work",
    "877": "I DIDNT UNDERESTAND THE PURPOSE OF TRUE OR FALSE DATA VARIAB;E ,, PLZ HELP ME !!!",
    "917": "Thanks for teaching us this \nvaluable information for free.\nAppreciate it.",
    "924": "⬆️⬆️⬆️ el es la solucion a tu problema, puedes ver muchas recomendaciones sobre el no permitas que nadie te engañe, mandale un mensaje que te ayude..",
    "926": "HOW DO YOU MAKE  AVERTICAL LINE ON A GAMING KAYBOARD",
    "927": "do i rlly need to buy license in Pycharm?  is there any IDE software that is free?",
    "929": "A college student taking a intro to python course. I need help can anyone point me into the right direction",
    "952": "1:00 is intro",
    "962": "Wanting to make a switch from construction to coding. Tired of being on the road away from my family... just need to make good money",
    "964": "i’m in year 10 i wana learn python",
    "972": "I’m turning 94 I’m learning new things",
    "975": "why are you using kali Linux graphics\n\nalso why is there a bin tag for bash?",
    "976": "how does he type () with one click",
    "977": "watch (53:10)",
    "1000": "Gracias a ti Dalas aprenderé algo nuevo en mi vida:D\nEsperemos que la comunidad para crear IA crezca y logremos el objetivo de la inmortalidad ❤",
    "1002": "La verdad es que estoy aqui con curiosidad y aprendiendo del tema gracias a Dalas. This video is awesome and they way you explain things, it really sounds easy to do. I´ve been practicing the string coding and I´m even thinking to write my next storie/novel through Python. Once again, ty to the yt channel Dalas Review because it´s highly unlikely I´ve be watching this video w/o him letting me know it´s not that complicated. Of course thank you to owner of this video and you definitely got my like and sub",
    "1006": "About to go through this video\n\nThis is my first time into python programming, kinda have passion for it\nI hope I benefit alot from here.\n\nWill come back to this comment when I'm done learning 😊",
    "1009": "no entiendo pero voy a esforzarme por aprender esto! gracias dalasito",
    "1015": "I really enjoyed watching Python in 4 hours. I have watched it several times and cannot thank you enough. I hope that the channel continues to grow. It's amazing to see that we have a very similar passion for teaching others to code on Youtube.",
    "1016": "Ty a lot for all of these AMAZINGLY long, yet short courses that are very clear to follow and very well explained.\nAll of this for free and no ads AT ALL!\nYou have changed lifes in a postive way and i wish you the best in life",
    "1018": "Thank you for providing this great content! I started learning python back in 2016 and have learned from youtube and online tutorials and actually now create python applications in my current job.  I actually started my own channel to pay if forward for everyone else.  Programming and coding should be a free skill that everyone around the world who has interest should be able to learn for free.",
    "1022": "Only 1 hour into this and I've already written a 26 line Mad Libs program. I'm shocked how quickly I've got the hang of this, fantastic explanations. Will update this comment as I progress further into the video!",
    "1040": "Trying to learn and I’m lost, it still hard and confusing to me. I’m have to watch and rewatch it more then 15 times",
    "1043": "Great overview - thanks!  Re: using Python  interpreter (last lesson) on Windows. I&#39;m  using Windows 1. I typed &#39;python3&#39; into the command prompt and it immediately launched a Microsoft store type popup - which I immediately shut down. Then I just tried typing &#39;python&#39; to see what I would get and Python 3.1.4 etc printed out and I could use the interpreter as per the lesson.",
    "1050": "Life saving, thanks bro!",
    "1054": "Thank you so much for sharing this content for free",
    "1061": "Thank you for these free tutorial",
    "1066": "I Don’t usually leave comment on YouTube but this kind person, did a wonderful work> Thank you guys.🤝",
    "1067": "I Don’t usually leave comment on YouTube but this kind person, did a wonderful work> Thank you guys.🤝",
    "1068": "1:03:13\ncheckpoint 1\nDictionary \ncheckpoin 2",
    "1083": "Ty I need this because our school only teach html. I'm In senior high btw",
    "1089": "This channel supposed to be the best channel on youtube and get more subscriber",
    "1099": "This dude is the reason I'll pass my semester",
    "1101": "Like los estamos aquí por Dalas para generar la mejor IA hacía la inmortalidad! 💕💪🏻☺️✨",
    "1111": "2:56:18 in and I LOVE this tutorial. But pro tip to those learning it. If at all possible, try the project after he describes what it is, THEN watch the tutorial. I've been doing this on the translator and guessing game, and it's really helped with understanding the code better. This doesn't mean you have to complete it, just try it out :)",
    "1114": "Thanks for the video, I watched the whole thing and I definitely feel like I understand these basics well now! Small comment you may or may not consider for future videos: Metaphorically in some sense, watching it is like watching a long Netflix series: You love the content and the characters, but when it's over you still want to know: \"What happens next!?\". Thanks again for the free content, new subscriber here.",
    "1130": "thanks gonna make minecraft for myself so its free",
    "1136": "If they dont or can't add him ,then its ok. Now he is ONLY interested in the ones that DO add him on skype. Please tell them, thank you.",
    "1147": "Hello guys, I am mechanical engineer, learning python because I am curious about programming,  to all the pro guys, can you give me small projects to make python code, I will do it for free for you . I want to be pro in this language. Looking forward.",
    "1169": "I'm struggling to understand what coding and python can do outside of a job perspective. What can Python do outside of work, for the layman who's never used coding software in their life like me? Just trying to conceptualize how this program is useful for people who won't use it in a job setting.\n\nThe meme has been overused at this point, but \"Learn to Code\" is somewhat arbitrary and useless unless those wanting to learn to code have some underlying basis of what it can do. That also leaves me stumped on one other point. When people say they spent a few hours of their evening for a \"coding session\", or having YouTube recommend me \"lo-fi playlists for coding\", what are you all even doing? Are you coding individual projects for freelance? Are you working from home at a corporate job? What projects are you even working on?\n\nPython, and coding languages in and of themselves are so convoluted that I can't really get a clear picture on what they're used for.",
    "1186": "Data Science in Marathi - https://youtube.com/playlist?list=PLFW1dVQqm4hWjZflXDTZF4QJ_UnPFVVbq",
    "1199": "This was one of my first of many Python tutorials during pandemic, And I am now junior Data scientist. Thank you guys.",
    "1201": "*_Can we just take a moment to appreciate all the efforts he puts in his videos?✨✨_*",
    "1206": "Absolutely one of the easiest to follow courses I've watched. The fact that this is free for everyone is insane. Halfway through in one session, gonna finish the other half tomorrow. Python has been way easier to learn than any other language because of the syntax.",
    "1212": "teaching everyone how to learn python for free and doing a great job educating people how to code. what a king",
    "1214": "This is my first week learning python, I’m taking notes in everything he says, thank you for the info, I’ll be back in 1 year to see the distance I’ve travelled, thank you.",
    "1218": "welp bois, I am gonna learn ( the basics ) of this, wish me luck. I am a noob to things like this. Also, what other programs should I know after python? I wanna be a game designer in the future. I have a Windows PC ( if that matters ) but am also gonna get a mac ( any recommendations? ) as I hear some things are more manageable on a mac than on windows. thanks to anyone who helps me out. PS: thanks for having these courses for free on here.",
    "1227": "Between this amd the cs50 course, which one should I start with? Im on vid 3 of cs50 and its overwhelming but i do know it will be fulfilling to watch all the lectures so that I have a foundation. However I just want to begin with python already.",
    "1232": "can anyone help? i am getting this text when i follow exactly what mike said. for integers, need not put \" \" when storing it as a variable, i can just put the number 50. But when i try to play it, it gives an error. \n\nTypeError: can only concatenate str (not \"int\") to str\n\nwhy is this happening?",
    "1243": "Hay Mike, I'm a real beginner in Python , I have been searching for courses on YouTube months ago until I saw your tuto , I'm 58 years and let me tell you this : you have such a gift and ability to explain so easily python because for us it seems like chineese and you look  so generous and so kind just THANK YOU for what you're doing. Good luck .",
    "1268": "how is this FREE!! THIS IS CRAZY!! thank you for your videos!!",
    "1310": "Hey Mike! Thanks a lot for this useful video. I am on a sabbatical to concentrate on my health. I am still confused on what to do next. This course has helped me nonetheless! btw, my granny loves your voice though she doesn't follow anything you said :)",
    "1325": "Heya look guys i can coding now!\n\n\n\n\n(Forgets everything after sleeping)",
    "1326": "hey, is saving necessary before running the program",
    "1332": "I am some one who doesn't even know how to open laptop, trying to learn new things hope it helps me atleast on something.",
    "1339": "Day 1: 1:18:53 \nDoing swagging",
    "1349": "Sir plz tell me how to solve windows files  search not working.",
    "1354": "What do question.prompt and  question.answer mean? Thanks guys",
    "1364": "Is it ok if I download python 3.10.5 will it change anything?",
    "1402": "Thank you once again for taking us through this code and keeping it ad free 🙏",
    "1411": "Thank you so much for creating this course, I'm teaching myself python as I'll be able to use it in my cryptography class to do arithmetic in solving ciphers. You truly have a future as an educator, and I'm astounded that you're not charging people for the volumes of information you offer. Thank you so much for everything you do.",
    "1415": "Thanks to the free code camp I have been learning python since 2020 actually I'm looking for a job this tutorial refreshed all the concepts for me it took 2 days to complete the tutorial because I was practicing on the other hand so just now I have finished the course thanks to Mike for providing this gem.",
    "1461": "So I have a few questions. When I started this course and downloaded Python from the Python website, I still could not get Python to show up on my terminal when ever I typed \"Python\". Instead, a new page would open, and take me to the Window's app store to install Python, even though I already had it on my computer. I clicked install, and now python shows up in the terminal. My first question is, what did I do wrong there? Why wasn't python showing up in the terminal when I had initially downloaded it from the website?  My second question has to deal with getting files from text editors to appear on the terminal. When I saved a file on Pycharm, and I opened the terminal and typed in \"python 'file name'.py\" it showed an error message. When I tried to troubleshoot the issue, I believe it has something to do with the pathway of these files, but I am still very confused on how to fix this. If anyone can help me, I'd greatly appreciate it. (I have a Windows 10)",
    "1483": "Faster method of installing Python (for Windows 10--11):\npress Windows Key + R\ntype \"winget install python3\"",
    "1485": "Bro can u help me i need idea on how i can merge my game data to its original apk and makes it original again and played by others with the data i inserted on it..pls enlighten me with your expertise",
    "1488": "Note:\nLeft Off: 1:56:58",
    "1490": "which certificate should i take to get a job in python programming at freecodecamp.org?"
}