{
    "138": "freeCodeCamp I love the work you guys are doing to this community\nremember my words. with these courses which you guys provide me for free i am learning a lot and i am hoping that i will be a developer one day. When i earn money you guys will be the first  place for me to donate.\nThanks for your service once again\ncheers !",
    "233": "I started learning coding from your video and I have something that is confusing me. in 1:33:10 \nWhy do we have to put the numbers 35 and 70 into strings in order to make the function work? subbed to your channel btw. thanks",
    "292": "Wow thank you so so much\nThis channel is the best\nI can't believe This is free \nI learned so much",
    "311": "Such a fresh and great content. I'm not a programmer but I started to do data analysis in my job and your videos help just amazingly, I can understand the different components perfectly. Watched other videos from other sources but they were a little hard to understand. Thank you very much for this, your channel is amazing",
    "334": "How does this course compare to the 12 hour Python course here? https://www.youtube.com/watch?v=XKHEtdqhLK8\nBig thanks to creators of both video, just curious which one I should watch.",
    "368": "easy to follow 👍",
    "433": "Can i use VS code.  And also I love this channel so if your new to the channel don't sweat it it is totally worth it😀",
    "534": "was great thank you.\n\n\nlearn free programming in  our channel",
    "771": "In loop i did exactly as you did but it just keeps on repeating the same no again and again like just going on 10 10 10 10 10 10 10 non stop ! What should i do",
    "793": "how do you make a new line?",
    "865": "For detailed videos on python topics, you can refer to https://www.youtube.com/c/FunCodingwithRahul/videos",
    "1054": "Thank you so much for sharing this content for free",
    "1097": "This channel supposed to be the best channel on youtube and get more subscriber",
    "1121": "Thanks for the video, I watched the whole thing and I definitely feel like I understand these basics well now! Small comment you may or may not consider for future videos: Metaphorically in some sense, watching it is like watching a long Netflix series: You love the content and the characters, but when it's over you still want to know: \"What happens next!?\". Thanks again for the free content, new subscriber here.",
    "1132": "thanks gonna make minecraft for myself so its free",
    "1188": "Data Science in Marathi - https://youtube.com/playlist?list=PLFW1dVQqm4hWjZflXDTZF4QJ_UnPFVVbq",
    "1272": "how is this FREE!! THIS IS CRAZY!! thank you for your videos!!",
    "1281": "1:03:13\ncheckpoint 1\nDictionary \ncheckpoin 2"
}